[{"id":1,"name":"Car Gauges","desc":"These gauges were created in Photoshop using various real-world car gauges as a guide to build from. Various layers containing various gradients and other techniques help to add depth and realism to the gauges. These were created to be used on an online driver school, as the user would progress through the course the gauges would update to show current position, how much longer the user has left on a particular course, and the ability for the user to change the language of the course. Im particularly proud of these gauges because I created these in my 4th month of design classes and I believe they show good use of the techniques we were taught.","thumb":"gallery/thumbs/gaugesThumb.jpg","image":"gallery/gauges.jpg","format":"print","isOdd":"odd"},{"id":2,"name":"Tri-Cities Reef Club logo","desc":"This badge was created in Photoshop and was done for a friend for his local coral reef and exotic fish social club. This 'logo' was much too detailed for print but was just what the client was looking for to help get their club exposure and to help convey what they stand for. The client was able to utilize this badge on other documents to help raise awareness and obtain new members.","thumb":"gallery/thumbs/fishLogo.jpg","image":"gallery/fishLogo.jpg","format":"print","isOdd":"no"},{"id":3,"name":"Alice In Chains concert poster","desc":"This is a psuedo concert poster created for the band Alice In Chains. The goal of this assignment was to create a poster using any of the techniques we were educated about in Full Sail class 'History of Visual Communications'. The skull and hand images were traced from medical diagrams and added to the canvas in a way that depicts excitement in the skeletons reaction. The band name text was created by hand in a psychodelic style as well as other visual elements to add to the psychodelic style of the poster.","thumb":"gallery/thumbs/aicThumb.jpg","image":"gallery/aic.jpg","format":"print","isOdd":"no"},{"id":4,"name":"Chronos Task Management Service","desc":"Chronos is a prototype task management system that allows users to keep track of clients and projects as well as tasks for those projects. The system provides the user with a comfortable, easy-to-use content management system that allows for the user to keep track of all of their client information. This project runs fully of JavaScript utilizing JQuery AJAX calls and PHP web services. This helps keep the site light and fast when performing queries and updates. Im particularlly proud of this design because it was my first design that another professional recognized as a 'definite portfolio piece'.","thumb":"gallery/thumbs/sfw2Thumb.jpg","image":"gallery/sfw2.jpg","format":"web","isOdd":"odd"},{"id":5,"name":"PaintBall Journals Ui design","desc":"This is a site design for a fictional paintball magazine. The site design focuses on user patterns, design principles, and usability mechanics. Lots of paint splatters and other effects were added to add some grundge to the site and to maintain the theme throughout. This was created in my 4th month of design classes, this should explain why the overall look and feel is a bit rough.","thumb":"gallery/thumbs/pbjThumb.jpg","image":"gallery/pbj.jpg","format":"web","isOdd":"no"},{"id":6,"name":"WorldSurf site design","desc":"Thi sis a site design for a fictional surfing website that keeps the surfing community connected and up to date on popular surfing destinations. This design uses blues and whites and subtle brush strokes to encompass the theme of the ocean and surfing. This was created in my 3rd month of design classes and isnt particularly great, but it does show good understanding of the techniques we were focusing on at the time.","thumb":"gallery/thumbs/wsThumb.jpg","image":"gallery/surfWorld.jpg","format":"web","isOdd":"no"},{"id":7,"name":"GMC Vacation site redesign","desc":"This is a site redesign I did for a client that owns a vacation package sales center. The site woudld help fascilitate customers in the travel process by providing them with package and location details as well as other important information. The sidebar navigation is composed of a list of the available destinations, when the user clicks on a destination the page automatically scrolls to that locations information module allowing the user to see all information for that location. Other features such as search and filtering are also available for customers to better refine their searches. This site was built using Photoshop, HTML, CSS, JavaScript | Jquery, and the Codeigniter PHP framework. -NOTE: this site is currently still under construction and should be up and running soon.","thumb":"gallery/thumbs/gmcThumb.jpg","image":"gallery/gmc.jpg","format":"web","isOdd":"odd"},{"id":8,"name":"Red5 site design","desc":"This is a site design for a fictional compnay called Red5, not to be confused with the streaming server comapny. This site is very scientific in its design, utilizing the actual cellular structure for the substance red 5 which is a food dye. The user has a top level navigation to manuever around the site, but also clicking on the molecule chains will load a modal window that provides the user with other 'Calls to Action' while providing an engaging way for the user to interact with the site. This site was created in my 4th month of design classes.","thumb":"gallery/thumbs/redLogo.jpg","image":"gallery/red5.jpg","format":"web","isOdd":"no"},{"id":9,"name":"SFW I site","desc":"This is a site design for a psuedo portfolio. This was site was created for my first JavaScript class as a way for us to practice with the various techniques we learned and plug-ins we built. The theme ofcourse is a chalkboard with interactive elements, adding a certain level of juxtoposition. I wanted some elements to look as if they were hand drawn with chalk and other elements to look as if they were taped on to the chalkboard such as photos. Im particularly proud of the iconography on this site, such as the logos and other interactive elements. These elements were drawn by hand using Photoshop and give the look that someone had drawn the icons with chalk.","thumb":"gallery/thumbs/sfwThumb.jpg","image":"gallery/sfw.jpg","format":"web","isOdd":"no"},{"id":10,"name":"RMO site","desc":"This is a site design that utilizes HTML5 video and audio tags to embed media and allow users to interact with this media. The pink and blue banner background was created by hand and is tilable and scalable without any visible seems or breaks in the pattern. The movie trailer modules load in from off screen upon page load, the logo and module navigation buttons fade in very slowly giving a nice effect. Im particularly proud of this design as I had no idea how to convey this information when I first started wire framing. In the end the design came out very nice and my instructor was not only pleased but also impressed with my creation.","thumb":"gallery/thumbs/rmoThumb.jpg","image":"gallery/rmo.jpg","format":"web","isOdd":"odd"},{"id":11,"name":"A. Parent Designs","desc":"A small portfolio site I redesigned for a friend. She originally had a 3 page layout that I condensed into 1 page to not only help keep the site small, fast, and clean but also to make it more user friendly. The site uses various JQuery techniques and plug-ins while maintaining a overal nice look and feel. The social network badges at the bottom invert on hover to give the effect they are being pushed in when the user rolls over one. My friend was very pleased with the redesign as was I. ","thumb":"gallery/thumbs/apdThumb.jpg","image":"gallery/apd.jpg","format":"web","isOdd":"no"},{"id":12,"name":"Color Blind","desc":"This is an image I created in Photoshop that utilizes negative colors, image masks, and various brushes to achieve a very cool effect. I was inspired to create this image after learning that most men carry a gene that allows for red/green color blindness. Turning the colors negative on the image provided me with the overall green color, I then duplicated the layer multiple times and applied a layer mask to each duplicate. I then used various brushes to clearn away neative space and allowing the red color underneath to come through. I wasnt expecting to create a great photo, but Im very pleased with the outcome and final product.","thumb":"gallery/thumbs/cmaThumb.jpg","image":"gallery/cma.jpg","format":"print","isOdd":"no"}]